# Квадратное уравнение.
#
# Пользователь вводит 3 коэффициента a, b и с.
# Программа вычисляет дискриминант (D) и корни уравнения (x1 и x2, если они есть)
# и выводит значения дискриминанта и корней на экран.
# При этом возможны следующие варианты:
#   Если D > 0, то выводим дискриминант и 2 корня
#   Если D = 0, то выводим дискриминант и 1 корень (т.к. корни в этом случае равны)
#   Если D < 0, то выводим дискриминант и сообщение "Корней нет"
# Подсказка: Алгоритм решения с блок-схемой (www.bolshoyvopros.ru).
# Для вычисления квадратного корня, нужно использовать
#
# Math.sqrt
#
# Например,
#
# Math.sqrt(16)
#
#  вернет 4, т.е. квадратный корень из 16.

print 'Введите коэффициент a: '
a = gets.to_i

print 'Введите коэффициент b: '
b = gets.to_i

print 'Введите коэффициент c: '
c = gets.to_i

# Вычисляем дискриминант квадратного уравнения
d = b**2 - 4 * a * c

# Если D > 0, то квадратное уравнение имеет два корня х1 и х2
if d > 0
  # Обозначим С = корень(D)
  c = Math.sqrt(d)
  # Вычисляем квадратные корни из D
  x1 = (-b + c) / (2 * a)
  x2 = (-b - c) / (2 * a)
  puts "Дискриминант: #{d}, корень x1: #{x1}, корень x2: #{x2}"
elsif d.zero?
  x = -b / (2 * a)
  puts "Дискриминант: #{d}, корень: #{x.to_f}"
else
  puts "Дискриминант: #{d}, Корней нет"
end
